#+BEGIN_COMMENT
.. title: Recovering From the Ubuntu 18.10 Upgrade
.. slug: recovering-from-the-ubuntu-1810-upgrade
.. date: 2018-10-27 10:40:09 UTC-07:00
.. tags: ubuntu,nvidia,upgrade,repair
.. category: Ubuntu
.. link: 
.. description: Recovering from the unbootable Ubuntu 18.10 problem.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 1
**Note:** I had it hang again on rebooting so there's an update at the end.
* Anything Else?
  
#+BEGIN_SRC bash :results output :exports both
ubuntu-drivers devices
#+END_SRC

#+RESULTS:
: == /sys/devices/pci0000:00/0000:00:02.0/0000:01:00.0 ==
: modalias : pci:v000010DEd00001402sv00001043sd00008581bc03sc00i00
: vendor   : NVIDIA Corporation
: model    : GM206 [GeForce GTX 950]
: driver   : nvidia-driver-390 - distro non-free recommended
: driver   : xserver-xorg-video-nouveau - distro free builtin
: 

This card actually tended to freeze when I used the open source video drivers that come with Ubuntu so not having the Nvidia drivers seemed like a bad idea. I'm hoping that re-installing them will fix whatever bad setup values were there so I did:

#+BEGIN_EXAMPLE
sudo ubuntu-drivers autoinstall
#+END_EXAMPLE

Cross your fingers.
